#!/usr/bin/env python
# -*- coding: euc-jp -*-

VOWELS = (
    u'', u'あ', u'い', u'う', u'え', u'お', u'ん',
    )

CONSONANTS = (
    u'あ', u'い', u'う', u'え', u'お',
    u'か', u'き', u'く', u'け', u'こ',
    u'さ', u'し', u'す', u'せ', u'そ',
    u'た', u'ち', u'つ', u'て', u'と',
    u'な', u'に', u'ぬ', u'ね', u'の',
    u'は', u'ひ', u'ふ', u'へ', u'ほ',
    u'ま', u'み', u'む', u'め', u'も',
    u'や', u'ゆ', u'よ',
    u'ら', u'り', u'る', u'れ', u'ろ',
    u'わ', u'を', u'ん', u'っ',
    u'が', u'ぎ', u'ぐ', u'げ', u'ご',
    u'ざ', u'じ', u'ず', u'ぜ', u'ぞ',
    u'だ', u'で', u'ど',
    u'ば', u'び', u'ぶ', u'べ', u'ぼ',
    u'ぱ', u'ぴ', u'ぷ', u'ぺ', u'ぽ',
    u'きゃ', u'きゅ', u'きょ',
    u'しゃ', u'しゅ', u'しょ',
    u'ちゃ', u'ちゅ', u'ちょ',
    u'にゃ', u'にゅ', u'にょ',
    u'ひゃ', u'ひゅ', u'ひょ',
    u'みゃ', u'みゅ', u'みょ',
    u'ぎゃ', u'ぎゅ', u'ぎょ',
    u'じゃ', u'じゅ', u'じょ',
    u'びゃ', u'びゅ', u'びょ',
    u'ぴゃ', u'ぴゅ', u'ぴょ',
    )

for c in CONSONANTS:
    r = []
    for v in VOWELS:
        r.append(v+c)
    print u' '.join(r)
